using System;
using System.Collections.Generic;
using System.Windows;
using System.Windows.Controls;
using Model;
using WPF_Lib;

namespace ProductsDemo.App
{
    public partial class MainWindow : Window
    {
        private int _sum;
        
        public MainWindow()
        {
            InitializeComponent();

            InitCards();

            _sum = 0;
        }

        private void InitCards()
        {
            var list = new List<Product>
            {
                new()
                {
                    Title = "Product 1",
                    Price = 100,
                    Annotation =
                        "Повседневная практика показывает, что укрепление и развитие структуры играет важную роль в формировании форм развития. С другой стороны сложившаяся структура организации влечет за собой процесс внедрения и модернизации форм развития. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач."
                },
                new()
                {
                    Title = "Product 2",
                    Price = 105,
                    Annotation =
                        "Повседневная практика показывает, что укрепление и развитие структуры играет важную роль в формировании форм развития. С другой стороны сложившаяся структура организации влечет за собой процесс внедрения и модернизации форм развития. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач."
                },
                new()
                {
                    Title = "Product 3",
                    Price = 200,
                    Annotation =
                        "Повседневная практика показывает, что укрепление и развитие структуры играет важную роль в формировании форм развития. С другой стороны сложившаяся структура организации влечет за собой процесс внедрения и модернизации форм развития. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач."
                },
                new()
                {
                    Title = "Product 4",
                    Price = 160,
                    Annotation =
                        "Повседневная практика показывает, что укрепление и развитие структуры играет важную роль в формировании форм развития. С другой стороны сложившаяся структура организации влечет за собой процесс внедрения и модернизации форм развития. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач."
                },
                new()
                {
                    Title = "Product 5",
                    Price = 1000,
                    Annotation =
                        "Повседневная практика показывает, что укрепление и развитие структуры играет важную роль в формировании форм развития. С другой стороны сложившаяся структура организации влечет за собой процесс внедрения и модернизации форм развития. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач."
                },
            };

            foreach (var product in list)
            {
                CardsPanel.Children.Add(new Card
                {
                    Title = product.Title,
                    Annotation = product.Annotation,
                    Price = product.Price,
                    Width = 200,
                    Action = Sum
                });
            }
        }

        private void Sum(object sender, EventArgs e)
        {
            var price = (((sender as Button)?.Parent as StackPanel)?.Parent as Card)?.Price ?? 0;
            _sum += price;
            LabelSum.Content = _sum.ToString();
        }
    }
}